#pragma once
#include <windows.h>
#include <string>
#include <vector>
#include <sstream>
#include <map>

namespace AppConst
{
    constexpr int GRID_SIZE = 16;
    constexpr int GRID_OFFSET_X = 5;
    constexpr int GRID_OFFSET_Y = 5;
    constexpr COLORREF GRID_COLOR_A = RGB(255, 255, 255);
    constexpr COLORREF GRID_COLOR_B = RGB(255, 255, 0);
    constexpr COLORREF GRID_COLOR_C = RGB(0, 255, 255);
    constexpr const wchar_t* SLAVE_APP_TITLE = L"GridMap";
    //std::string utf8_str = u8"中文测试😀"; // C++11+支持u8前缀标识UTF-8字面量
    
    // 三进制映射表：下标0-15对应字符0-F，值为3位三进制数（画刷索引）
    constexpr const int BRUSH_TRIAD_TABLE[16][3] = {
        {0,0,0}, // 0 → 十进制0 → 三进制000
        {0,0,1}, // 1 → 十进制1 → 三进制001
        {0,0,2}, // 2 → 十进制2 → 三进制002
        {0,1,0}, // 3 → 十进制3 → 三进制010
        {0,1,1}, // 4 → 十进制4 → 三进制011
        {0,1,2}, // 5 → 十进制5 → 三进制012
        {0,2,0}, // 6 → 十进制6 → 三进制020
        {0,2,1}, // 7 → 十进制7 → 三进制021
        {0,2,2}, // 8 → 十进制8 → 三进制022
        {1,0,0}, // 9 → 十进制9 → 三进制100
        {1,0,1}, // A → 十进制10 → 三进制101
        {1,0,2}, // B → 十进制11 → 三进制102
        {1,1,0}, // C → 十进制12 → 三进制110
        {1,1,1}, // D → 十进制13 → 三进制111
        {1,1,2}, // E → 十进制14 → 三进制112
        {1,2,0}  // F → 十进制15 → 三进制120
    };

    // 把char: 0 1 2 3 4 5 6 7 8 9 A B C D E F 映射到int: 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15
    constexpr const int8_t CHAR_TO_DEC_MAP[128] = {
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 10
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 20
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 30
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 40
        -1,-1,-1,-1,-1,-1,-1,          // 47
        0, 1, 2, 3, 4, 5, 6, 7, 8, 9,  // ASCII('0'~'9') 48-57  → 映射值0-9
        -1,-1,-1,-1,-1,-1,-1,          // 64
        10, 11, 12, 13, 14, 15,        // ASCII('A'~'F') 65-70  → 映射值10-15
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 80
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 90
        -1,-1,-1,-1,-1,-1,             // 96
        10, 11, 12, 13, 14, 15,        // ASCII('a'~'f') 97-102 → 映射值10-15
        -1,-1,-1,-1,-1,-1,-1,-1,       // 110
        -1,-1,-1,-1,-1,-1,-1,-1,-1,-1, // 120
        -1,-1,-1,-1,-1,-1,-1,-1        // 128
    };



} // namespace Win32App end

